
/*
	音乐播放器插件
	作者：Jack
	版本：beat 1.2.0
*/
var player = {

	//这是音乐播放器的DOM元素
	music : null ,

	//乐曲库
	music_lib : ['年轻的战场.mp3','告白气球.mp3','庐州月.m4a','平凡之路.mp3','月亮之上.mp3'] ,

	//当前播放的歌曲

	index : 0 ,

	name : '1.mp3' ,

	lrc : ["[00:00.09]年轻的战场"+
"[00:00.12]演唱：张杰"+
"[00:00.57]"+
"[00:02.06]今天我"+
"[00:06.28]终于站在这年轻的战场"+
"[00:10.31]请你给我"+
"[00:13.03]一束爱的光芒"+
"[00:17.15]今天我"+
"[00:21.51]将要走向这胜利的远方"+
"[00:25.96]我要把这世界为你点亮"+
"[00:32.90]"+
"[00:49.39]我的梦想"+
"[00:52.74]在每个醒来的早晨"+
"[00:55.76]敲打我的心房"+
"[00:58.29]告诉自己成功的道路"+
"[01:01.70]还很漫长"+
"[01:04.67]我的梦想"+
"[01:07.87]在每次把握机会"+
"[01:10.44]表达自我主张"+
"[01:13.41]展现给你年轻但一样宽阔的胸膛"+
"[01:20.90]所有经历风雨的温柔与坚强"+
"[01:27.09]所有青春无悔"+
"[01:29.58]烦恼与成长"+
"[01:35.96]所有奔向未来的理想与张扬"+
"[01:42.39]所有冲破捆绑的热爱与癫狂"+
"[01:48.55]"+
"[01:48.78]今天我"+
"[01:52.90]终于站在这年轻的战场"+
"[01:57.00]请你为我 骄傲鼓掌"+
"[02:03.83]今天我"+
"[02:08.11]将要走向这胜利的远方"+
"[02:12.85]我要让这世界为我激荡"+
"[02:18.22]"+
"[02:32.43]我的梦想"+
"[02:35.65]在每个失败的时候"+
"[02:38.55]迎来祝福目光"+
"[02:41.11]懂得幸福就是彼此"+
"[02:44.34]依靠的肩膀"+
"[02:47.48]我的梦想"+
"[02:50.82]在每次付出汗水"+
"[02:53.49]创造生命绽放"+
"[02:56.21]告诉世界我们这一代"+
"[02:59.01]自信的力量"+
"[03:03.86]所有经历风雨的温柔与坚强"+
"[03:09.99]所有青春无悔"+
"[03:13.10]烦恼与成长"+
"[03:18.94]所有奔向未来的理想与张扬"+
"[03:25.26]所有冲破捆绑的热爱与癫狂"+
"[03:31.52]今天我"+
"[03:35.78]终于站在这年轻的战场"+
"[03:39.98]请你给我"+
"[03:42.55]一束爱的光芒"+
"[03:46.72]今天我"+
"[03:51.04]将要走向这胜利的远方"+
"[03:55.82]我要把这世界为你点亮"+
"[04:01.94]今天我"+
"[04:06.24]终于站在这年轻的战场"+
"[04:10.95]请你为我"+
"[04:13.48]骄傲鼓掌"+
"[04:17.21]今天我"+
"[04:21.49]想要走向这胜利的远方"+
"[04:26.26]我要让这世界为我激荡"+
"[04:33.97]我要让这世界为我激荡"+
"[04:40.29]",


		"[ti:告白气球] "+
"[ar:周杰伦] "+
"[al:周杰伦的床边故事] "+
"[offset:0] "+
""+
"[00:00.98]告白气球 "+
"[00:04.19]词：方文山 "+
"[00:06.29]曲：周杰伦 "+
"[00:07.78]演唱：周杰伦 "+
"[00:17.78] "+
"[00:23.65]塞纳河畔 左岸的咖啡 "+
"[00:26.45]我手一杯 品尝你的美 "+
"[00:28.94] "+
"[00:29.49]留下唇印的嘴 "+
"[00:31.89] "+
"[00:34.42]花店玫瑰 名字写错谁 "+
"[00:37.18]告白气球 风吹到对街 "+
"[00:40.18]微笑在天上飞 "+
"[00:42.59] "+
"[00:44.27]你说你有点难追 想让我知难而退 "+
"[00:49.40]礼物不需挑最贵 只要香榭的落叶 "+
"[00:54.67]喔 营造浪漫的约会 不害怕搞砸一切 "+
"[01:00.01]拥有你就拥有 全世界 "+
"[01:04.15] "+
"[01:05.13]亲爱的 爱上你 从那天起 "+
"[01:11.48]甜蜜的很轻易 "+
"[01:14.59] "+
"[01:15.70]亲爱的 别任性 你的眼睛 "+
"[01:21.36] "+
"[01:22.08]在说我愿意 "+
"[01:25.42] "+
"[01:49.14]塞纳河畔 左岸的咖啡 "+
"[01:51.72]我手一杯 品尝你的美 "+
"[01:54.20] "+
"[01:54.87]留下唇印的嘴 "+
"[01:57.31] "+
"[01:59.81]花店玫瑰 名字写错谁 "+
"[02:02.39]告白气球 风吹到对街 "+
"[02:04.70] "+
"[02:05.44]微笑在天上飞 "+
"[02:07.99] "+
"[02:09.61]你说你有点难追 想让我知难而退 "+
"[02:14.78]礼物不需挑最贵 只要香榭的落叶 "+
"[02:19.65] "+
"[02:20.18]喔 营造浪漫的约会 不害怕搞砸一切 "+
"[02:25.40]拥有你就拥有 全世界 "+
"[02:29.42] "+
"[02:30.46]亲爱的 爱上你 从那天起 "+
"[02:36.87]甜蜜的很轻易 "+
"[02:39.98] "+
"[02:41.01]亲爱的 别任性 你的眼睛 "+
"[02:46.74] "+
"[02:47.33]在说我愿意 "+
"[02:51.16] "+
"[02:51.85]亲爱的 爱上你 恋爱日记 "+
"[02:57.46] "+
"[02:58.06]飘香水的回忆 "+
"[03:01.49] "+
"[03:02.42]一整瓶 的梦境 全都有你 "+
"[03:08.11] "+
"[03:08.82]搅拌在一起 "+
"[03:12.29] "+
"[03:13.16]亲爱的别任性 你的眼睛 "+
"[03:20.01] "+
"[03:21.37]在说我愿意 "+
""+
"音乐之家网 http://www.yinyuezj.com提供",
		
"[ti:庐州月]"+
"[ar:许嵩]"+
"[al:寻雾启示]"+
"[by:vaecn箴言]"+
"[00:03.13]庐州月"+
"[00:05.50]词/曲/编曲/唱：许嵩"+
"[00:07.02]"+
"[00:08.59]"+
"[00:20.51]儿时凿壁偷了谁家的光"+
"[00:24.12]宿昔不梳 一苦十年寒窗"+
"[00:27.70]如今灯下闲读 红袖添香"+
"[00:32.43]半生浮名只是虚妄"+
"[00:35.72]"+
"[01:55.69][00:36.03]三月 一路烟霞 莺飞草长"+
"[01:59.29][00:39.24]柳絮纷飞里看见了故乡"+
"[02:03.15][00:43.00]不知心上的你是否还在庐阳"+
"[02:07.74][00:47.97]一缕青丝一生珍藏"+
"[02:11.29][00:51.12]"+
"[02:11.71][00:51.36]桥上的恋人入对出双"+
"[02:14.98][00:54.67]桥边红药叹夜太漫长"+
"[02:18.40][00:58.28]月也摇晃 人也彷徨"+
"[02:22.09][01:01.91]乌蓬里传来了一曲离殇"+
"[02:25.21][01:05.79]"+
"[03:15.66][02:27.74][01:07.94]庐州月光 洒在心上"+
"[03:19.32][02:31.32][01:11.62]月下的你不复当年模样"+
"[03:23.22][02:35.77][01:15.60]太多的伤 难诉衷肠"+
"[03:27.04][02:39.26][01:19.07]叹一句当时只道是寻常"+
"[01:22.54]"+
"[03:30.55][02:43.08][01:23.26]庐州月光 梨花雨凉"+
"[03:34.53][02:46.47][01:26.79]如今的你又在谁的身旁"+
"[03:38.13][02:50.80][01:30.62]家乡月光 深深烙在我心上"+
"[03:42.34][02:55.49][01:35.29]却流不出当年泪光"+
"[03:01.43]庐州的月光 在我心上"+
"[03:05.05]太多的伤 难诉衷肠"+
"[03:08.69]如今的你又在谁的身旁"+
"[03:12.59]我却流不出当年泪光"+
"[01:48.43]"+
"[01:49.34]"+
"[03:49.33]================="+
"[03:51.50] END"+
"[04:03.96]===================",
	

'[00:00.00]歌词千寻 www.lrcgc.com'+
			'[00:06.33]平凡之路 - 小普'+
			'[00:07.32]词：韩寒,朴树'+
			'[00:08.43]曲：朴树'+
			'[00:09.91]'+
			'[00:15.43]徘徊着的在路上的'+
			'[00:16.81]你要走吗 Via Via'+
			'[00:23.95]易碎的 骄傲着'+
			'[00:26.84]'+
			'[00:31.07]那也曾是我的模样'+
			'[00:33.25]'+
			'[00:35.84]沸腾着的 不安着的'+
			'[00:39.48]'+
			'[00:41.27]你要去哪 Via Via'+
			'[00:45.08]'+
			'[00:47.24]谜一样的 沉默着的'+
			'[00:53.25]故事你真的在听吗'+
			'[00:57.14]'+
			'[00:58.04]我曾经跨过山和大海'+
			'[00:61.37]也穿过人山人海'+
			'[00:64.32]我曾经拥有着一切'+
			'[01:07.25]转眼都飘散如烟'+
			'[01:10.11]我曾经失落失望'+
			'[01:12.64]失掉所有方向'+
			'[01:16.33]直到看见平凡'+
			'[01:19.15]才是唯一的答案'+
			'[01:23.16]'+
			'[01:35.61]当你仍然 还在幻想'+
			'[01:39.19]'+
			'[01:41.48]你的明天 Via Via'+
			'[01:45.67]'+
			'[01:47.15]她会好吗 还是更烂'+
			'[01:55.78]'+
			'[01:59.25]对我而言是另一天'+
			'[01:58.93]'+
			'[01:58.24]我曾经毁了我的一切'+
			'[01:61.32]只想永远地离开'+
			'[01:64.26]我曾经堕入无边黑暗'+
			'[02:07.24]想挣扎无法自拔'+
			'[02:10.23]我曾经像你像他'+
			'[02:12.67]像那野草野花'+
			'[02:16.32]绝望着 也渴望着'+
			'[02:19.17]也哭也笑也平凡着'+
			'[02:22.26]我曾经跨过山和大海'+
			'[02:25.25]也穿过人山人海'+
			'[02:28.32]我曾经问遍整个世界'+
			'[02:31.29]从来没得到答案'+
			'[02:34.24]我不过像你像他'+
			'[02:36.66]像那野草野花'+
			'[02:40.29]冥冥中这是我'+
			'[02:43.23]唯一要走的路啊',
	
"[ti:月亮之上]"+
"[ar:凤凰传奇]"+
"[al:月亮之上]"+
"[by:南昌余子]"+
"[00:04.22]《月亮之上》"+
"[00:12.95]原唱：凤凰传奇"+
"[00:22.36]我在仰望"+
"[00:24.81]月亮之上"+
"[00:27.18]有多少梦想在自由地飞翔"+
"[00:32.16]昨天遗忘"+
"[00:34.48]风干了忧伤"+
"[00:37.16]我要和你重逢在那苍茫的路上"+
"[00:42.20]生命已被牵引"+
"[00:44.55]潮落潮涨"+
"[00:47.19]有你的远方"+
"[00:49.77]就是天堂"+
"[00:51.69]我等待我想象我的灵魂早已脱缰"+
"[00:53.23]马蹄声起马蹄声落"+
"[00:55.33]哦耶 哦耶"+
"[01:00.25]看见的看不见的"+
"[01:01.68]瞬间的永恒的"+
"[01:02.92]青草长啊白雪飘扬"+
"[01:05.12]哦耶 哦耶"+
"[01:09.30]在我的心上"+
"[01:14.62]谁在呼唤"+
"[01:17.35]情深意长"+
"[01:19.96]让我的渴望"+
"[01:21.56]像白云在飘荡"+
"[01:24.69]东边牧马"+
"[01:27.22]西边放羊"+
"[01:29.66]野辣辣的情歌就唱到了天亮"+
"[01:34.50]在日月沧桑后"+
"[01:37.03]你在谁身旁"+
"[01:39.72]用温柔眼光"+
"[01:42.23]让黑夜绚烂"+
"[01:44.40]我等待我想象我的灵魂早已脱缰"+
"[01:46.04]马蹄声起马蹄声落"+
"[01:47.92]哦耶 哦耶"+
"[01:52.72]看见的看不见的"+
"[01:54.43]瞬间的永恒的"+
"[01:55.68]青草长啊白雪飘扬"+
"[01:57.84]哦耶 哦耶"+
"[02:02.72](汉音)啊 日 温 它 闻 乃 萨 然 (汉音)"+
"[02:05.56](汉音)啊嘎日 得歌热 德个德乐 辉~~~"+
"[02:12.63](汉音)啊 日 屋布日恩 达 嘎"+
"[02:15.66](汉音)五 乐 无 归 都 云 打 辉~~~"+
"[02:22.63]节奏响起"+
"[02:23.97]煽动了想象"+
"[02:25.18]让摇曳的身体"+
"[02:26.54]开始开始思想"+
"[02:27.89]马头琴悠扬马奶酒穿肠"+
"[02:29.95]我的爱情奔跑在呼伦贝尔草原上"+
"[02:32.84]你的善良我不能不能抵抗"+
"[02:35.43]你的纯洁将我的心紧紧捆绑"+
"[02:37.85]哦,你的笑容"+
"[02:39.21]让我找到最后信仰"+
"[02:40.49]美丽月亮"+
"[02:41.65]你让霓虹暗淡无光"+
"[02:43.37]我等待我想象我的灵魂早已脱缰"+
"[02:45.65]马蹄声起马蹄声落"+
"[02:47.72]哦耶 哦耶"+
"[02:52.66]看见的看不见的"+
"[02:54.22]瞬间的永恒的"+
"[02:55.43]青草长啊白雪飘扬"+
"[02:57.56]哦耶 哦耶"+
"[03:02.60]我等待我想象我的灵魂早已脱缰"+
"[03:05.01]马蹄声起马蹄声落"+
"[03:07.39]哦耶 哦耶"+
"[03:12.56]看见的看不见的"+
"[03:14.07]瞬间的永恒的"+
"[03:15.27]青草长啊白雪飘扬"+
"[03:17.46]哦耶 哦耶"+
"[03:22.60]我等待我想象我的灵魂早已脱缰"+
"[03:25.20]马蹄声起马蹄声落"+
"[03:27.40]哦耶 哦耶"],

	//音乐播放器初始化
	init : function(id){

		this.music = document.getElementById(id);
		
		if(!this.music){
			$('body').append("<audio id='"+id+"'></audio>");
			this.music = document.getElementById(id);
		}

		console.log("已经存在" + id);

		this.load(this.music_lib[this.index]); //初始化的时候就加载一首歌曲，不要每次播放的时候重新加载，那样就无法暂停了
	} ,

	getMusicName : function(){
		return this.name;
	} ,

	//加载音乐
	load : function(url){
		this.music.src = "sound/" + url ;

		this.name = url;

		console.log(url + "加载成功！");
	} ,

	//播放音乐
	playMusic : function(){
		
		console.log("暂停状态=======" + player.music.paused);
		if(this.music.paused){
			this.music.play();
		}else{

			this.music.pause();
		}
		
	} ,



	//播放停止
	stop : function(){
		this.music.pause();
	} ,

	//下一首
	next : function(){

		this.index ++ ;

		if(this.index == this.music_lib.length){
			this.index = 0;
		}

		//this.playMusic();

		this.load(this.music_lib[this.index]); //重新加载音乐

	} ,

	//上一首
	prev : function(){

		this.index -- ;
		if(this.index < 0){
			this.index = this.music_lib.length - 1;
		}	

		//this.playMusic();

		this.load(this.music_lib[this.index]); //重新加载音乐

	} ,

	//音乐播放过程中的监听事件
	timeupdate : function(callback){
		
		this.music.addEventListener('timeupdate',function(){
			callback(player.music);
		});
		
	} ,

	play : function(url){
		this.music.src = "sound/" + url;
		this.music.play();
	}


};